# s = input('Введи строку:')
s = 'Мама мыла раму.'
k = len(s)
print('Длина строки:', k) # print('Длина строки:', len(s))
print('Первый символ:', s[0])
print('Последний символ:', s[k-1])
print('Последний символ:', s[-1])
print(s[0:4])

k_a = 0
for i in range(k):
    if s[i] == 'а':
        k_a += 1
print('1 способ. Количество букв a:', k_a)
# 2 способ решения
print('2 способ. Количество букв a:', s.count('а'))
s = s.replace('Мама мыла', 'Папа мыл')
print(s)
#  s[0] = 'м' ТАК НЕ РАБОТАЕТ!!!
s = s.replace('П', 'п', 1)
print(s)